In [100]:
import pandas as pd
import numpy as np

df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [101]:
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [102]:
df['FlightNumber'] = (df['FlightNumber'].fillna(df['FlightNumber'].ffill() + 10)).astype('int64')

In [103]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [104]:
df['FlightNumber'].dtypes

dtype('int64')

In [107]:
new = df["From_To"].str.split("_", expand = True) # expand changes the object in to a DataFrame
new.iloc[:,0] = new.iloc[:,0].str.capitalize()
new.iloc[:,1] = new.iloc[:,1].str.capitalize()
new.columns = ['From','To']
new

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

In [108]:
df.drop('From_To', axis = 1, inplace = True)

In [109]:
df.insert(1,'From',new['From'])
df.insert(2,'To',new['To'])

In [110]:
df

   FlightNumber      From         To  RecentDelays              Airline
0         10045    London      Paris      [23, 47]               KLM(!)
1         10055    Madrid      Milan            []    <Air France> (12)
2         10065    London  Stockholm  [24, 43, 87]  (British Airways. )
3         10075  Budapest      Paris          [13]       12. Air France
4         10085  Brussels     London      [67, 32]          "Swiss Air"

In [111]:
final_df = pd.concat([df,df['RecentDelays'].apply(pd.Series).add_prefix('Delays_')], axis = 1)
final_df.drop('RecentDelays', axis = 1, inplace = True)

In [112]:
final_df

,FlightNumber,From,To,Airline,Delays_0,Delays_1,Delays_2
0,10045,London,Paris,KLM(!),23.0,47.0,NaN
1,10055,Madrid,Milan,<Air France> (12),NaN,NaN,NaN
2,10065,London,Stockholm,(British Airways. ),24.0,43.0,87.0
3,10075,Budapest,Paris,12. Air France,13.0,NaN,NaN
4,10085,Brussels,London,"""Swiss Air""",67.0,32.0,NaN